# -*- coding: utf-8 -*-
# Домашнее задание. Лучше если каждая задачка будет оформлена в виде одного файла .py
# 3) Пользователь вводит температуру в градусах Цельсия. Вывести температуру в градусах фаренгейта
t = float(input())
print(float(t * 1.8 + 32))
