# -*- coding: utf-8 -*-
# Домашнее задание. Лучше если каждая задачка будет оформлена в виде одного файла .py
# 1) Дан список [1, 2, 3, 4, 5]. Вывести квадраты всех чисел из списка

a = [1,2,3,4,5]
print([elem**2 for elem in a ])

